{
  "skills":{
    "subHeading":"Skills",
    "text":"THE BEST WAY TO SHARPEN YOUR SKILLS IS TO USE THEM",
    "skillSet1":[
      {
        "id":1,
        "name":"Computer Science",
        "class":"progress percent80",
        "percentage":"Expert"
      },
      {
        "id":2,
        "name":"Finance",
        "class":"progress percent60",
        "percentage":"Intermediate"
      },
      {
        "id":3,
        "name":"Web Development",
        "class": "progress percent40",
        "percentage": "Beginner"
      }
    ],
    "skillSet2":[
      {
        "id":4,
        "name":"Artificial Intelligence",
        "class":"progress percent85",
        "percentage":"Expert"
      },
      {
        "id":5,
        "name":"Mathematics",
        "class":"progress percent80",
        "percentage":"Expert"
      }
    ]
  },
  "about":{
    "subHeading":"About Me",
    "text":"I'M NOT PERFECT, I'M ORIGINAL",
    "aboutMe":"This is Niharika. I grew up in India and lately moved to USA. I’m a curious, passionate and dedicated student, all set to graduate in 2022. I’ve had the opportunity to enrich myself by exploring industry experience as well as research. Programming and Machine Learning excites me. I enjoy analytical, quantitative and mathematical modelling. Powerful fundamentals of Computational Science and practical implementation are some of my strengths. I’m deeply passionate about Finance and Natural Language Processing. I believe I’m an excellent leader, who loves taking special initiative to empower girls in tech field. Outside work, you’d find me reading mystery novels, painting, cooking or playing badminton. I aspire to use my skills and knowledge to make a difference in the real world. I look forward to meeting like-minded passionate humans!"
  },
  "banner":{
    "title": "I am Niharika Dalsania",
    "buttonName":"My Resume",
    "portfolioLink":"https://drive.google.com/file/d/1n55PrIXMH6KQ8SP4Hde0t16pDJcfoHKb/view?usp=sharing",
    "social":[
      {
        "id":1,
        "name":"Github",
        "link":"https://github.com/DN612"
      },
      {
        "id":2,
        "name":"Linkedin",
        "link":"https://www.linkedin.com/in/niharika-dalsania-0791021a9"
      },
      {
        "id":3,
        "name":"Kaggle",
        "link":"https://www.kaggle.com/niharikadalsania"
      }
    ]
  },
  "navigation":{
    "imgSource":"/images/logo.png",
    "sectionName":[
      {"id":1,"name":"Home","link":"#"},
      {"id":2,"name":"About","link":"#about"},
      {"id":3,"name":"Resume","link":"#resume"},
      {"id":4,"name":"Skill","link":"#skill"},
      {"id":5,"name":"Achievements","link":"#awards"},
      {"id":6,"name":"Project","link":"#projects"},
      {"id":7,"name":"Contact","link":"#contact"}
    ]
  },
  "projects":{
    "subHeading": "My Projects",
    "text":"A PROJECT IS WORTH WHEN IT STARTS WORKING FOR YOU, NOT WHEN YOU START WORKING FOR IT",
    "project":[
      {
        "id": 2,
        "heading": "Finance/ML",
        "title": "Predicting Equity Index Volatility",
        "link":"https://github.com/DN612/Predicting-Equity-Index-Volatility",
        "text": "Performed comprehensive exploratory data analysis on potential predictors for forecasting daily realized volatility of the S&P 500 Index over different market regimes. Compared performance of linear and non-linear models with baseline GARCH model. Analysed fairness and destructive power of the model."
      },
      {
        "id": 3,
        "heading": "Finance/ML",
        "title":"Forecasting Hidden Market States (IAQF)",
        "link":"https://github.com/DN612/Forecasting-Hidden-Market-State",
        "text": "Used three state Hidden Markov Model (HMM) to identify market regimes using Russell 3000 index returns, that can be of paramount importance for investors/traders for implementing market-timing-based strategies. Combined results of the Hidden Markov Model with the states detected by leading market indicators of market regime changes using Random Forest Classifiers."
      },
      {
        "id": 1,
        "heading": "Deep Learning",
        "title":"Image to image translation using GAN",
        "link":"https://github.com/DN612/StarGAN",
        "text": "Performed detailed analysis of shortcomings in the current single domain to domain image translation models via literature review. Reproduced the results of the paper “StarGAN: Unified Generative Adversarial Networks for Multi-Domain Image-to-Image Translation” which implements StarGAN and compared all the models to identify the superior one."
      }
    ]
  },
  "contact":{
    "imgSource":"/images/logo.png",
    "text":"The only way to do extraordinary work is to be passionate about it. Keep searching till you find this passion. Don't settle for ordinary.",
    "info":[
      {
        "id":1,
        "name":"Location",
        "value":"New York, USA"
      },
      {
        "id":2,
        "name":"Email",
        "value":"dalsanianiharika@gmail.com"
      },
      {
        "id":3,
        "name":"Call",
        "value":"+1 (607) 262-3921"
      } 
    ]
  },
  "resume":{
    "subHeading": "Resume",
    "text":"EXPERIENCE IS NOT WHAT HAPPENS TO YOU, IT'S WHAT YOU DO WITH WHAT HAPPENS TO YOU",
    "education":[
      {
        "id":3,
        "title":"ORIE M.Eng. Financial Engineering concentration with Financial Data Science",
        "heading":"Cornell University, Ithaca, USA - CGPA: 3.96/4.00",
        "timeStamp":"Aug 2021 - Dec 2022",
        "selectedCourse": "Selected coursework:",
        "text":"Derivative Securities, Investment and Portfolio Management, Statistics for Financial Engineering, Optimisation Modeling in Finance, Python for Finance, Stochastic Calculus for Financial Engineering, Monte Carlo for Financial Engineering, Statistical Data Mining, Big Messy Data, Big Data Technologies",
        "awards":""
      },
      {
        "id":1,
        "title":"B.Tech. in Information and Communication Technology with minor in Computational Science",
        "heading": "Dhirubhai Ambani Institute of Information and Communication Technology, Gandhinagar, India - CGPA: 9.44/10.00",
        "timeStamp":"Aug 2017 - May 2020",
        "selectedCourse": "Selected coursework:",
        "text":"Computational Finance, Machine Learning, Deep learning, Calculus, Probability, Statistics and Information Theory, Group theory and Linear Algebra, Optimisation, Computational and numerical methods, High Performance Computing, Modelling and Simulation, Quantum Computing, Introductory Computational Physics, Design and Analysis of Algorithm, Principles of Economics, Technology and Economic, Organisation Behaviour",
        "awards":""
      },
      {
        "id":2,
        "title":"10+2 Higher Education",
        "heading": "PV Modi High School",
        "timeStamp": "July 2015 - Mar 2017",
        "text": "Secured 99.99 percentile in grade 12",
        "awards":"Rank: 1 (out of more than 70000)"
      }
    ],
    "exp":[
      {
        "id":0,
        "title":"(Upcoming) Machine Learning Analyst",
        "data":[
          {
            "id":1,
            "timeStamp":"Jun 2022 - Aug 2022",
            "heading":"Kemnay Advisory Services, NYC, USA",
            "text":"Structure and process quantitative/textual data in financial domain. Train and cross validated diverse Machine Learning Classifier. Evaluate and summarize performance results of in and out sample testing."
          }
        ]
      },
      {
        "id":1,
        "title":"Product Engineer Intern",
        "data":[
          {
            "id":1,
            "timeStamp":"Feb 2021 - May 2021",
            "heading":"Sprinklr, Gurgaon, India",
            "text":"Build a docker containing deep learning model for emotion identification. Trained the model using labelled data generated using GPU via zero shot classification model pretrained over MNLI dataset. Performed testing of different sentiment predictions models based on model metadata shifted to tensorflow servable platform to compare with performance of original models."
          }
        ]
      },
      {
        "id":2,
        "title":"Computational Finance Intern",
        "data":[
          {
            "id":1,
            "heading":"Indian Institute of Management Ahmedabad",
            "timeStamp":"Jan 2020 - Dec 2020",
            "text":"Built a web app using shiny package in R language for Option Pricing using Black Scholes model, Greeks/Advanced Greeks pricing for a portfolio of options."
          }
        ]
      },
      {
        "id":3,
        "title":"Machine Learning Intern",
        "data":[
          {
            "id":1,
            "heading":"Spriklr, Gurgaon, India",
            "timeStamp":"May, 2020 - Jun, 2020",
            "text":"Worked on Multilingual Toxic Comment Classification. Implemented a range of approaches from baseline classifiers to sophisticated models like Cross Language Modelling RoBERTa (XLM-R) and ensemble models. Further extend the work to a fully functional Document Classifier."
          }
        ]
      },
      {
        "id":4,
        "title":"Undergraduate Researcher",
        "data":[
          {
            "id":1,
            "timeStamp":"Dec, 2019 - Dec, 2020",
            "heading":"Dhirubhai Ambani Institute of Information and Communication Technology (in collaboration with Institute for Plasma Research)",
            "text":"Devised a novel approach for synthetic time series data generation for tokamak plasma disruption. Built a model for identifying pre-disruptive current that acts as a precursor for predicting disruption. Presented the work at International Conference Of Plasma Sciences 2020 and published a paper \"An Application of Machine Learning for Plasma Current Quench Studies via Synthetic Data Generation\"in Fusion Engineering and Design.",
            "link": "https://www.sciencedirect.com/science/article/abs/pii/S0920379621003549?via%3Dihub"
          }
        ]
      }
    ]
  },
  "awards":{
    "subHeading":"Achievements",
    "text":"COMFORT IS THE ENEMY OF ACHIEVEMENT",
    "firstChild":"Rank 1 in State Board examinations in all 4 semesters of grade 11-12 (out of a total of above 70,000 students)",
    "achv":[
      {
        "id":"item1",
        "name":"Recipient of Dhirubhai Ambani Scholarship by Reliance Foundation."
      },
      {
        "id":"item2",
        "name":"Among the top 1% students who were offered scholarship of 0.8 lakhs under the INSPIRE initiative for pursuing pure science."
      },
      {
        "id":"item3",
        "name":"Recipient of Certificate of Appreciation from University Dean for best summer internship presentation (Multilingual Toxic Comment Classification - Sprinklr)."
      }
    ]
  }
}